namespace Chapter4_1_1 {
    /* [問題4-1-1]
    　　以下の順にYearMonthクラスを定義してください。本章で学んだイディオムが使えるところでは、イディオムを使ってください。

    　　1.
    　　年（Year）と月（Month）の2つのプロパティを持つクラスYearMonthを定義してください。
    　　このとき、2つのプロパティは読み取り専用にし、値はコンストラクタで指定できるようにしてください。
    　　なお、引数で渡される月の値は1から12の範囲にあるものと仮定してかまいません。

    　　2.
    　　YearMonthクラスに、Is21Centuryプロパティを追加してください。
    　　2001年から2100までが21世紀です。この処理では加減乗除は行わないでください。

    　　3.
    　　YearMonthクラスに1カ月後を求めるAddOneMonthメソッドを追加してください。
    　　このとき、自分自身のプロパティは変更せずに、新たなYearMonthオブジェクトを生成しその値を返してください。
    　　12月の時の処理に注意してください。

    　　ToStringメソッドをオーバーライドしてください。
    　　結果は、"2017年8月"といった形式にしてください。
    */
    internal class Program {
        static void Main(string[] args) {
        }
    }
}
